app/Views/pages/inventory.php

SELECT *
FROM `school`
---
                                <form class="forms-sample" action="display" method="post">
                                    <div class="input-group mb-2 mr-sm-2">
                                        <?php $sclmdl = new \App\Models\SchoolModel();
                                        $schools = $sclmdl->asArray()->findAll(); ?>

SELECT *
FROM `stock`
WHERE `sid` = '2'
---
                                </p>
                                <?php
                                $p_model = new \App\Models\StockModel();
                                $result = $p_model->asArray()->where('sid', $_SESSION['sid'])->findAll();