app/Views/pages/school_list.php

SELECT *
FROM `school`
---
                                    <form class="forms-sample" action="display" method="post">
                                        <div class="input-group mb-2 mr-sm-2">
                                            <?php $sclmdl = new \App\Models\SchoolModel();
                                            $schools = $sclmdl->asArray()->findAll(); ?>

SELECT *
FROM `products`
WHERE `sid` = '2'
---

                                <?php
                                $p_model = new \App\Models\ProductsModel();
                                $result = $p_model->asArray()->where('sid', $_SESSION['sid'])->findAll();