app/Controllers/BaseController.php

    public function check_data()
    {
        $userModel = new \App\Models\UserModel();
        $users = $userModel->find(1);
---
SELECT *
FROM `user`
WHERE `user`.`id` = 1