app/Controllers/Delete.php

    public function delete_product()
    {
        if ($_SERVER["REQUEST_METHOD"] == "POST") {
            $db = new \App\Models\StockModel();
            $sku = $_POST["sku"];

            $db->where('sku', $sku)->delete();
---
DELETE FROM `stock`
WHERE `sku` = '18'