app/Controllers/Home.php

SELECT *
FROM `school`
SELECT *
FROM `stock`
WHERE `sid` = '1'
---
    public function bill()
    {
        $sclmdl = new SchoolModel();
        $schools = $sclmdl->asArray()->findAll();

        $sid = session('sid');
        $p_model = new StockModel();
        $result = $p_model->asArray()->where('sid', $sid)->findAll();

SELECT *
FROM `school`
SELECT *
FROM `stock`
WHERE `sid` = 1
---
    public function inventory()
    {
        $sclmdl = new SchoolModel();
        $schools = $sclmdl->asArray()->findAll();

        $sid = session('sid');
        $p_model = new StockModel();
        $result = $p_model->asArray()->where('sid', $sid)->findAll();

SELECT *
FROM `school`
---
    public function blank_page()
    {
        $sclmdl = new SchoolModel();
        $schools = $sclmdl->asArray()->findAll();